// src/mappings.ts

// Default fallback — minimal safe mapping
export const defaultMapping: Record<string, string> = {
}

// Named presets
export const namedMappings = {
  amharic: {
    ህe: "ሀ", ህu: "ሁ", ህi: "ሂ", ህa: "ሃ", ሀe: "ሄ", h: "ህ", ህo: "ሆ",
    ልe: "ለ", ልu: "ሉ", ልi: "ሊ", ልa: "ላ", ለe: "ሌ", l: "ል", ልo: "ሎ", 
    ሕe: "ሐ", ሕu: "ሑ", ሕi: "ሒ", ሕa: "ሓ", ሐe: "ሔ", ህh: "ሕ", ሕo: "ሖ", 
    ምe: "መ", ምu: "ሙ", ምi: "ሚ", ምa: "ማ", መe: "ሜ", m: "ም", ምo: "ሞ", 
    ሥe: "ሠ", ሥu: "ሡ", ሥi: "ሢ", ሥa: "ሣ", ሠe: "ሤ", ስs: "ሥ", ሥo: "ሦ", 
    ርe: "ረ", ርu: "ሩ", ርi: "ሪ", ርa: "ራ", ረe: "ሬ", r: "ር", ርo: "ሮ", 
    ስe: "ሰ", ስu: "ሱ", ስi: "ሲ", ስa: "ሳ",ሰe: "ሴ",s: "ስ",ስo: "ሶ", 
    ሽe: "ሸ",ሽu: "ሹ",ሽi: "ሺ",ሽa: "ሻ",ሸe: "ሼ",S: "ሽ",ሽo: "ሾ", 
    ቅe: "ቀ",ቅu: "ቁ",ቅi: "ቂ",ቅa: "ቃ",ቀe: "ቄ",q: "ቅ",ቅo: "ቆ",ቅw: "ቍ", 
    ብe: "በ",ብu: "ቡ",ብi: "ቢ",ብa: "ባ",በe: "ቤ",b: "ብ",ብo: "ቦ", 
    ትe: "ተ",ትu: "ቱ",ትi: "ቲ",ትa: "ታ",ተe: "ቴ",t: "ት",ትo: "ቶ", 
    ችe: "ቸ",ችu: "ቹ",ችi: "ቺ",ችa: "ቻ",ቸe: "ቼ",c: "ች",ችo: "ቾ", 
    ኅe: "ኀ",ኅu: "ኁ",ኅi: "ኂ",ኅa: "ኃ",ኀe: "ኄ",x: "ኅ",ኅo: "ኆ",ኅw: "ኍ",
    ንe: "ነ",ንu: "ኑ",ንi: "ኒ",ንa: "ና",ነe: "ኔ",n: "ን",ንo: "ኖ", 
    ኝe: "ኘ",ኝu: "ኙ",ኝi: "ኚ",ኝa: "ኛ",ኘe: "ኜ",N: "ኝ",ኝo: "ኞ", 
    እa: "አ",እu: "ኡ",እi: "ኢ",አe: "ኣ", እe:"ኤ", e: "እ",  o: "ኦ", 
    ክe: "ከ",ክu: "ኩ",ክi: "ኪ",ክa: "ካ",ከe: "ኬ",k: "ክ",ክo: "ኮ",ክw: "ኵ", 
    ኽe: "ኸ",ኽu: "ኹ",ኽi: "ኺ",ኽa: "ኻ",ኸ: "ኼ",kx: "ኽ",ኽo: "ኾ",ኽw: "ዅ", 
    ውe: "ወ",ውu: "ዉ",ውi: "ዊ",ውa: "ዋ",ወe: "ዌ",w: "ው",ውo: "ዎ",  // add ዐ
    ዝe: "ዘ",ዝu: "ዙ",ዝi: "ዚ",ዝa: "ዛ",ዘe: "ዜ",z: "ዝ",ዝo: "ዞ", 
    ዥe: "ዠ",ዥu: "ዡ",ዥi: "ዢ",ዥa: "ዣ",ዠe: "ዤ",Z: "ዥ",ዥo: "ዦ", 
    ይe: "የ",ይu: "ዩ",ይi: "ዪ",ይa: "ያ",የe: "ዬ",y: "ይ",ይo: "ዮ", 
    ድe: "ደ",ድu: "ዱ",ድi: "ዲ",ድa: "ዳ",ደe: "ዴ",d: "ድ",ድo: "ዶ", 
    ጅe: "ጀ",ጅu: "ጁ",ጅi: "ጂ",ጅa: "ጃ",ጀe: "ጄ",j: "ጅ",ጅo: "ጆ", 
    ግe: "ገ",ግu: "ጉ",ግi: "ጊ",ግa: "ጋ",ገe: "ጌ",g: "ግ",ግo: "ጎ",ግw: "ጕ", 
    ጥe: "ጠ",ጥu: "ጡ",ጥi: "ጢ",ጥa: "ጣ",ጠe: "ጤ",T: "ጥ",ጥo: "ጦ", 
    ጭe: "ጨ",ጭu: "ጩ",ጭi: "ጪ",ጭa: "ጫ",ጨe: "ጬ",C: "ጭ",ጭo: "ጮ", 
    ጵe: "ጰ",ጵu: "ጱ",ጵi: "ጲ",ጵa: "ጳ",ጰe: "ጴ",p: "ጵ",ጵo: "ጶ", 
    ጽe: "ጸ",ጽu: "ጹ",ጽi: "ጺ",ጽa: "ጻ",ጸe: "ጼ",ጥS: "ጽ",ጽo: "ጾ", 
    ፅe: "ፀ",ፅu: "ፁ",ፅi: "ፂ",ፅa: "ፃ",ፀe: "ፄ",ትz: "ፅ",ፅw: "ፆ", 
    ፍe: "ፈ",ፍu: "ፉ",ፍi: "ፊ",ፍa: "ፋ",ፈe: "ፌ",f: "ፍ",ፍo: "ፎ", 
    ፕe: "ፐ",ፕu: "ፑ",ፕi: "ፒ",ፕa: "ፓ",ፐe: "ፔ",P: "ፕ",ፕo: "ፖ", 
    ቭe: "ቨ",ቭu: "ቩ",ቭi: "ቪ",ቭa: "ቫ",ቨe: "ቬ",v: "ቭ",ቭo: "ቮ"
  },
  
  tigrinya: {
    z: "ዚ",
    j: "ጂ",
    s: "ሲ",
    b: "ቢ",
    t: "ቲ",
    k: "ኪ",
    l: "ሊ",
    m: "ሚ",
    n: "ኒ",
  }
}

// Helper: get full mapping by name
export function getMappingByName(name: string): Record<string, string> {
  if (name === "none" || name === "default") {
    return {}
  }
  return namedMappings[name as keyof typeof namedMappings] || defaultMapping
}

// List of available mapping names for UI
export const mappingNames = Object.keys(namedMappings)

